In [1]:
import pandas as pd

In [3]:
data={
    'name':["mitesh","hiren","harakh","krunal"],
    'age':[18,19,20,21],
    'city':["dholka","surendarangar","muli","ahemdabad"]
}

In [5]:
df=pd.DataFrame(data)

In [7]:
df

     name  age           city
0  mitesh   18         dholka
1   hiren   19  surendarangar
2  harakh   20           muli
3  krunal   21      ahemdabad

In [11]:
drop_column=df.drop(columns='age')

In [13]:
drop_column

     name           city
0  mitesh         dholka
1   hiren  surendarangar
2  harakh           muli
3  krunal      ahemdabad